### Задание 1

In [71]:
import pandas as pd

In [72]:
a = { 
    "author_id": [1, 2, 3],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
}

In [73]:
authors = pd.DataFrame(a)

In [74]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [75]:
b = { 
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
}

In [76]:
book = pd.DataFrame(b)

In [77]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

In [78]:
authors_price = pd.merge(authors, book, on='author_id', how='inner')

In [79]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [80]:
authors_price = authors_price.sort_values(by='price', ascending=False)

In [81]:
authors_price

   author_id author_name            book_title  price
3          2       Чехов      Толстый и тонкий    500
0          1    Тургенев           Отцы и дети    450
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
2          1    Тургенев     Дворянское гнездо    350
1          1    Тургенев                 Рудин    300
6          3  Островский  Таланты и поклонники    290

In [82]:
top5 = authors_price.head(n=5)

In [83]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Задание 4

In [84]:
authors_stat  = authors_price[['author_name','price']].groupby('author_name').agg([('min_price','min'), 
                                                                                   ('max_price','max'), 
                                                                                   ('mean_price','mean')])

In [86]:
authors_stat

                price
            min_price max_price  mean_price
author_name
Островский        290       370  330.000000
Тургенев          300       450  366.666667
Чехов             450       500  475.000000

### Задание 5**

In [87]:
authors_price['cover']=['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [89]:
authors_price

   author_id author_name            book_title  price    cover
3          2       Чехов      Толстый и тонкий    500  твердая
0          1    Тургенев           Отцы и дети    450   мягкая
4          2       Чехов       Дама с собачкой    450   мягкая
5          3  Островский                 Гроза    370  твердая
2          1    Тургенев     Дворянское гнездо    350  твердая
1          1    Тургенев                 Рудин    300   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [90]:
pd.pivot_table?

In [91]:
import numpy as np

In [95]:
book_info = pd.pivot_table(authors_price, values='price', index=['author_name'],columns=['cover'], aggfunc=np.sum)

In [112]:
book_info

cover        мягкая  твердая
author_name
Островский      290      370
Тургенев        750      350
Чехов           450      500

In [113]:
book_info.to_pickle("book_info.pkl")

In [114]:
book_info2 = pd.read_pickle("book_info.pkl")

In [116]:
book_info.compare(book_info2)

AttributeError: 'DataFrame' object has no attribute 'compare'

In [117]:
equality = book_info == book_info2

In [118]:
equality

cover        мягкая  твердая
author_name
Островский     True     True
Тургенев       True     True
Чехов          True     True